# 4.6 - Combining & Exporting Data - Part 1

### This script contains the following points:

* 01 - Importing Libraries
* 02 - Importing Data
   * a) Check the output of df_ords
   * b) Check the output of df_ords_prior 
* 03 - Merging Data
* 04 - Exporting Data

---

## 01 - Importing Libraries

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

---

## 02 - Importing Data

In [2]:
# Define path

path = r'/Users/juanigalvalisi/01-07-2022 - Instacart Basket Analysis'

In [3]:
# Import CSVs

df_ords = pd.read_csv(os.path.join(path, '02 - Data', 'Prepared Data', 'orders_checked.csv'), index_col = False)

In [4]:
df_ords_prior = pd.read_csv(os.path.join(path, '02 - Data', 'Prepared Data', 'orders_products_prior_wrangled.csv'), index_col = False)

### a) Check the output of df_ords

In [5]:
# Check the output I

df_ords.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_last_order,new_customer
0,0,0,2539329,1,1,2,8,NaN,True
1,1,1,2398795,1,2,3,7,15.0,False
2,2,2,473747,1,3,3,12,21.0,False
3,3,3,2254736,1,4,4,7,29.0,False
4,4,4,431534,1,5,4,15,28.0,False

In [6]:
# Check the output II

df_ords.shape

(3421083, 9)

In [7]:
# Delete both Unnamed columns

del df_ords['Unnamed: 0']
del df_ords['Unnamed: 0.1']

In [8]:
# Check the output of Unnamed columns elimination

df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_last_order,new_customer
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

### b) Check the output of df_ords_prior

In [9]:
# Check the output of df_ords_prior

df_ords_prior.head()

   Unnamed: 0  order_id  product_id  add_to_cart_order  reordered
0           0         2       33120                  1          1
1           1         2       28985                  2          1
2           2         2        9327                  3          0
3           3         2       45918                  4          1
4           4         2       30035                  5          0

In [10]:
df_ords_prior.shape

(32434489, 5)

---

## 03 - Combining Data

In [11]:
# Merge df_ords + df_ords_prior

df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [12]:
# Check the merging output 

df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_last_order,new_customer,Unnamed: 0,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,24076664,196,1,0,both
1,2539329,1,1,2,8,NaN,True,24076665,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,24076666,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,24076667,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,24076668,26405,5,0,both

In [13]:
df_merged_large.shape

(32434489, 12)

In [14]:
# Check the joins frequency

df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

---

## 04 - Exporting data

In [15]:
# Export df_merged_large as .csv

df_merged_large.to_csv(os.path.join(path, '02 - Data','Prepared Data', 'orders_products_combined.csv'))

In [16]:
# Export data df_merged_large as .pkl

df_merged_large.to_pickle(os.path.join(path, '02 - Data','Prepared Data', 'orders_products_combined.pkl'))